{
  "description": [
    "The Touareg, Volkswagen's first SUV, was introduced in 2002, marking the brand's entry into an already exploding segment. It set the stage for the success of Volkswagen's SUV lineup, which now spans across various segments.",
    "The design DNA of the Touareg, characterized by a distinct front end, raised V-shaped bonnet, and unified headlights, can be seen in all Volkswagen SUVs. The vehicle gained attention for its powerful engines, including the V10 TDI and the limited-edition W12 models, capable of doing unbelievable stunts, like towing a Boeing 747.",
    "Carrying the legacy of the first three generations, the 2024 model accommodates new technologies and characteristic features that make the SUV stand out. For instance, besides technologies like Park Assist Plus, Trailer Assist, and Night Vision, one advanced technology seamlessly combines the roof load sensor with the running gear electronics.",
    "This integration enhances agility by detecting the presence of a roof box and relaying this information to systems like Electronic Stability Control. Consequently, the vehicle's stability is improved as these systems intervene earlier. On the other hand, without a roof load, Touareg's systems enable a sportier driving experience.",
    "With four versions, Basic, Elegance, R-Line, and R Model, the SUV offers a wide variety of types of equipment capable of suiting every buyer's needs. The V6 engine is omnipresent, but in different instances, it can vary from gasoline to diesel or hybrid.",
    "Even though the powertrain as a whole is not the same for all the variants, they all share an eight-speed automatic transmission and the 4MOTION permanent all-wheel drive system. Besides the basic version, all the Touaregs will be equipped standard with the new IQ.Light HD matrix headlights, a new technology on all Volkswagen vehicles that will feature almost 40 000 micro LEDs capable of providing an interactive light carpet for a safer driving experience.",
    "The Touareg offers versatile on-road and off-road capabilities through its driving profile selection feature. The driver can choose from various profiles and adjust parameters for the automatic gearbox, steering, optional air suspension, engine responsiveness, and assist systems. Depending on the version, the vehicle also offers advanced running gear systems like active roll compensation and all-wheel steering. Adding this to the already existing wide and tall vehicle stance makes adventures much more accessible.",
    "The interior of the SUV has received an upgrade to provide an enhanced experience. It now comes standard with the Innovision Cockpit, which combines the Digital Cockpit with a 30.5 cm display and a high-end infotainment system called Discover Pro Max featuring a 38.1 cm touchscreen.",
    "The two displays create a seamless digital landscape on a single axis, offering features such as lane-level navigation and high-resolution HD map data. Additionally, the voice control system of the Touareg has gone through significant upgrades.",
    "Volkswagen also increased comfort during long road trips through foamed surfaces around the knee area and a 730-watt Dynaudio sound system to keep the passengers entertained."
  ],
  "engine": {
    "cylinders": "v6",
    "displacement": "2995 cm3",
    "power": ["250.1 kw", "340 hp", "335 bhp"],
    "torque": ["332 lb-ft", "450 nm"],
    "fuel system": "turbocharged direct injection",
    "fuel": "gasoline",
    "fuel capacity": ["19.8 gallons", "75.0 litre"]
  },
  "performance": {
    "top speed": ["155 mph", "249 km/h"],
    "acceleration": "6.1 s"
  },
  "transmission": {
    "drive type": "all wheel drive",
    "gearbox": "8-speed automatic"
  },
  "brakes": { "front": "ventilated discs", "rear": "ventilated discs" },
  "tires": { "tire size": "255/60 r18 h" },
  "dimensions": {
    "length": "192 in (4877 mm)",
    "width": "78.1 in (1984 mm)",
    "height": "67.4 in (1712 mm)",
    "front/rear track": "65.2/65.8 in (1,656/1,671 mm)",
    "wheelbase": "114.3 in (2903 mm)",
    "cargo volume": "28.6 cuft (810 l)",
    "turning circle": "40 ft (12.2 m)"
  },
  "fuel economy (wltp)": {
    "low": "14.8 mpg us (15.9 l/100km)",
    "medium": "21.6 mpg us (10.9 l/100km)",
    "high": "25.8 mpg us (9.1 l/100km)",
    "extra high": "22.8 mpg us (10.3 l/100km)",
    "combined": "21.8 mpg us (10.8 l/100km)",
    "co2 emissions (combined)": "245 g/km"
  }
}
